# Connecting to the Database From Jupyter

In this notebook we will access, query and manipulate the database from out jupyter notebook.

First, lets download and import the mysql connector and then connect to the database.

In [ ]:
!pip install mysql-connector-python
print("Installed.")

In [3]:
import mysql.connector
print("Successfully imported!")

Successfully imported!

### Connecting to Database

In [41]:
# private info
USER = "*************"
PASS = "***********"
HOST = "************"
DATABASE = "**********"

In [46]:
#Create database connection
try:
    conn = mysql.connector.connect(
      host = HOST,
      user = USER,
      password = PASS,
      database = DATABASE
    )
    print ("Connected to database!")
    print(conn)

except:
    print ("Unable to connect.")

Connected to database!
<mysql.connector.connection.MySQLConnection object at 0x000001DB83549160>

Lets now run a query!

In [47]:
# define the cursor
cursor = conn.cursor()

In [49]:
# run command
cursor.execute("SELECT * FROM pets LIMIT 10;")

# fetch result
results = cursor.fetchall()

for result in results:
  print(result)

('J6-8562', 'Blackie', 'Doggie', 'male', 11, 5168)
('Q0-2001', 'Roomba', 'Cat', 'male', 9, 5508)
('M0-2904', 'Simba', 'Cat', 'male', 1, 3086)
('R3-7551', 'Keller', 'Parrot', 'female', 2, 7908)
('P2-7342', 'Cuddles', 'Doggie', 'male', 13, 4378)
('X0-8765', 'Vuitton', 'Parrot', 'female', 11, 7581)
('Z4-5652', 'Priya', 'Cat', 'female', 7, 7343)
('Z4-4045', 'Simba', 'Cat', 'male', 0, 2700)
('M8-7852', 'Cookie', 'Cat', 'female', 8, 7606)
('J2-3320', 'Heisenberg', 'Doggie', 'male', 3, 1319)

In [50]:
# change the first dog's age to 10
cursor.execute("UPDATE pets SET Age = 10 WHERE PetID = 'J6-8562'")
conn.commit()

# run command
cursor.execute("SELECT * FROM pets LIMIT 10")

# fetch result
results = cursor.fetchall()

for result in results:
  print(result)

('J6-8562', 'Blackie', 'Doggie', 'male', 10, 5168)
('Q0-2001', 'Roomba', 'Cat', 'male', 9, 5508)
('M0-2904', 'Simba', 'Cat', 'male', 1, 3086)
('R3-7551', 'Keller', 'Parrot', 'female', 2, 7908)
('P2-7342', 'Cuddles', 'Doggie', 'male', 13, 4378)
('X0-8765', 'Vuitton', 'Parrot', 'female', 11, 7581)
('Z4-5652', 'Priya', 'Cat', 'female', 7, 7343)
('Z4-4045', 'Simba', 'Cat', 'male', 0, 2700)
('M8-7852', 'Cookie', 'Cat', 'female', 8, 7606)
('J2-3320', 'Heisenberg', 'Doggie', 'male', 3, 1319)

### Using SQL Magic
To communicate with SQL Databases from within a JupyterLab notebook, we can also use the SQL "magic" provided by the ipython-sql extension to make things much more straight forward.

In [ ]:
# Install ipython-sql and pymysql for connection
!pip install ipython-sql
!pip install PyMySQL
# load the extension
%load_ext sql

print("Loaded Successfully!")

Using a %%sql at the top of a cell lets you use the cell exactly like you would within a SQL editor.

In [35]:
# connect to server
%sql mysql+pymysql://username:password@host/database
print("Connected Successfully!")

Connected Successfully!

In [37]:
%%sql

SELECT * FROM owners LIMIT 10;

   mysql+mysqldb://root:***@localhost/refresher
 * mysql+pymysql://root:***@localhost/refresher
10 rows affected.

[(6049, 'Debbie', 'Metivier', '315 Goff Avenue', 'Grand Rapids', 49503),
 (2863, 'John', 'Sebastian', '3221 Perry Street', 'Davison', 48423),
 (3518, 'Connie', 'Pauley', '1539 Cunningham Court', 'Bloomfield Township', 48302),
 (3663, 'Lena', 'Haliburton', '4217 Twin Oaks Drive', 'Traverse City', 49684),
 (1070, 'Jessica', 'Velazquez', '3861 Woodbridge Lane', 'Southfield', 48034),
 (7101, 'Bessie', 'Yen', '30 Cunningham Court', 'Rochester Hills', 48306),
 (2419, 'Luisa', 'Cuellar', '1308 Shingleton Road', 'Kalamazoo', 49007),
 (6194, 'Karen', 'Torres', '3941 Ritter Avenue', 'Center Line', 48015),
 (5833, 'Mary', 'Hurtado', '4865 Juniper Drive', 'Saint Charles', 48655),
 (9614, 'Carmen', 'Ingram', '1056 Eagle Drive', 'Detroit', 48219)]

Lets now change the first owner's name.

In [38]:
%%sql 
UPDATE owners
SET Name = 'Deb'
WHERE Name = 'Debbie';

SELECT * FROM owners LIMIT 10;

   mysql+mysqldb://root:***@localhost/refresher
 * mysql+pymysql://root:***@localhost/refresher
1 rows affected.
10 rows affected.

[(6049, 'Deb', 'Metivier', '315 Goff Avenue', 'Grand Rapids', 49503),
 (2863, 'John', 'Sebastian', '3221 Perry Street', 'Davison', 48423),
 (3518, 'Connie', 'Pauley', '1539 Cunningham Court', 'Bloomfield Township', 48302),
 (3663, 'Lena', 'Haliburton', '4217 Twin Oaks Drive', 'Traverse City', 49684),
 (1070, 'Jessica', 'Velazquez', '3861 Woodbridge Lane', 'Southfield', 48034),
 (7101, 'Bessie', 'Yen', '30 Cunningham Court', 'Rochester Hills', 48306),
 (2419, 'Luisa', 'Cuellar', '1308 Shingleton Road', 'Kalamazoo', 49007),
 (6194, 'Karen', 'Torres', '3941 Ritter Avenue', 'Center Line', 48015),
 (5833, 'Mary', 'Hurtado', '4865 Juniper Drive', 'Saint Charles', 48655),
 (9614, 'Carmen', 'Ingram', '1056 Eagle Drive', 'Detroit', 48219)]